Revit 2026 API

# RebarContainerItemNumberOfBarPositions Property

---

The number of potential bars in the set.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int NumberOfBarPositions { get; set; }
```
```vb
Public Property NumberOfBarPositions As Integer
	Get
	Set
```
```cpp
public:
property int NumberOfBarPositions {
	int get ();
	void set (int value);
}
```
```fsharp
member NumberOfBarPositions : int with get, set
```

#### Property Value

Int32

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: the number of bar positions numberOfBarPositions is less than 1 or more than 1002. |
| InapplicableDataException | When setting this property: This rebar element represents a single bar (the layout rule is Single). |

The number of positions is equal to the number of actual bars (the Quantity), plus one or two more positions depending on IncludeFistBar and IncludeLastBar.

#### Reference

RebarContainerItem Class

Autodesk.Revit.DB.Structure Namespace